package mycar;

public class KK_class {

	public static void main(String[] args) {

		/*
		 * 절차지향 프로그래밍 c언어  효율의 차이가있고 코드재사용성을 높임.
		 * 
		 * 
		 * 객체지향 프로그래밍 Java,c#,python 
		 * 부품화 하여 용도에 맞는 조립이 가능.
		 * 다형성
		 * 
		 * 설계도 ->제품
		 * 클래스->객체
		 * 
		 * 클래스의 3요소
		 * 1.필드(field)
		 * ->데이터를 저장하는 공간.
		 * 2.생성자(constructor):객체 생성시 필드 초기값 세팅
		 * =>객체를 만들때 따라야 하는 규칙을 정의
		 * =>객체생성을 도와주는 블록
		 * =>객체 생성시 필요한 매개변수를 규정함.
		 * =>매개변수가 있을수도 없을수도 있다.
		 * =>매개변수가 없으면 : 기본생성자
		 * =>생성자의 이름은 클래스 이름과 동일함.
		 * 3.메소드(method):특정 기능을 수행하는 부분 (함수랑 비슷하게 취급)
		 * =>특정 기능을 정의한 블록
		 * =>매개변수 있을수도 없을수도 있다.
		 * =>메소드가 호출되면 자신이 가지고있는 기능을 수행함.
		 * =>기능 수행이 끝나면 리턴값이 존재한다.
		 */
	
		
		//1.Student 클래스 생성
		//2.Student Main 클래스 main 메소드 가짐.
		
		
		
		
		
		
		
		
		
		
	}

}
